package com.github.cloud.constant;

/**
 * @author : glw
 * @datetime : 2021/3/24 20:29
 * @Description : 中文字符常量
 */
public interface ChineseConstant {

    // -------------------- 名字 --------------------

    /**
     * 姓
     */
    String LAST_NAME = "赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董粱杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯昝管卢莫经房裘缪干解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁荀羊於惠甄麴家封芮羿储靳汲邴糜松井段富巫乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫宁仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟薄印宿白怀蒲邰从鄂索咸籍赖卓蔺屠蒙池乔阴欎胥能苍双闻莘党翟谭贡劳逄姬申扶堵冉宰郦雍舄璩桑桂濮牛寿通边扈燕冀郏浦尚农温别庄晏柴瞿阎充慕连茹习宦艾鱼容向古易慎戈廖庾终暨居衡步都耿满弘匡国文寇广禄阙东殴殳沃利蔚越夔隆师巩厍聂晁勾敖融冷訾辛阚那简饶空曾毋沙乜养鞠须丰巢关蒯相查後荆红";

    /**
     * 汉字高位起始位置
     */
    int HIGH_START = 176;

    /**
     * 汉字低位起始位置
     */
    int LOW_START = 161;

    /**
     * 汉字高位范围
     */
    int HIGH_RANGE = 39;

    /**
     * 汉字低位起始位置
     */
    int LOW_RANGE = 93;

    /**
     * 汉字编码所占字节长度
     */
    int BYTE_LENGTH = 2;

    /**
     * 名字最小长度（包含）
     */
    int MIN_LENGTH = 1;

    /**
     * 名字最大长度（不包含）
     */
    int MAX_LENGTH = 3;

    /**
     * 汉字字符集编码
     */
    String CHARSET = "GBK";

    // -------------------- 性别 --------------------

    /**
     * 性别最小值（包含）
     */
    int MIN_GENDER = 1;

    /**
     * 性别最大值（不包含）
     */
    int MAX_GENDER = 4;
}
